import Task01.Solution;

public class App {
    public static void main(String[] args) throws Exception {
        /*
         * Реализуйте структуру телефонной книги с помощью HashMap. 
         * Программа также должна учитывать, что во входной структуре будут 
         * повторяющиеся имена с разными телефонами, их необходимо считать, 
         * как одного человека с разными телефонами. Вывод должен быть отсортирован 
         * по убыванию числа телефонов.(можно выводить без сортировки, 
         * но обязательно в отдельном методе)
         */
        Solution.PhoneBook();

        
    }
}
